bew_config.org
#+TITLE: Brett Witty's Emacs configuration
#+OPTIONS: toc:4 h:4
#+OPTIONS: tags:nil
#+STARTUP: overview
#+PROPERTY: tangle yes
#+EXCLUDE_TAGS: noexport

* Configuration

This is inspired by Sacha Chua's configuration file.

To load this, run =(org-babel-load-file "~/bew_config.org")=.
* About me

** Personal information

#+BEGIN_SRC emacs-lisp
(setq user-full-name "Brett Witty"
      user-mail-address "brettwitty@brettwitty.net")
#+END_SRC
* Startup

** Add my emacs directories

These are my standard add-on library paths

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (expand-file-name "~/"))
(add-to-list 'load-path (expand-file-name "~/libraries/"))
(add-to-list 'load-path "~/elisp")
(add-to-list 'load-path "~/libraries/")
(require 'color-theme)
#+END_SRC
** Start up configuration

Get rid of the startup screen.

#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-screen t)
#+END_SRC
** Emacs customize

It's better to just chuck everything into this file, but sometimes Customize is too easy to use.

#+BEGIN_SRC emacs-lisp
(setq custom-file "~/bew_custom.el")
(load-file custom-file)
#+END_SRC
* Global configuration
** BrettW custom settings

#+BEGIN_SRC emacs-lisp
(defvar brettw/default-screen-width 120)
(defvar brettw/default-screen-height 70)
#+END_SRC
** Global mode

We like these global modes.

#+BEGIN_SRC emacs-lisp
(global-font-lock-mode t)
(delete-selection-mode t)
(auto-compression-mode t)
(display-time-mode t)
(line-number-mode t)
(show-paren-mode t)
(transient-mark-mode t)
(recentf-mode t)
(global-ede-mode t)
(ido-mode t)
#+END_SRC

YASnippet needs some of its own customization.
#+BEGIN_SRC emacs-lisp
(require 'yasnippet)
(setq yas/snippet-dirs '("~/snippets" "~/libraries/yasnippet/snippets/" ))
(yas/global-mode 1)
#+END_SRC
** Packages

#+BEGIN_SRC emacs-lisp
(add-to-list 'package-archives
  '("melpa" . "http://melpa.milkbox.net/packages/") t)
#+END_SRC
** Coding systems

We only like UTF-8 because the alternatives are rubbish.
#+BEGIN_SRC emacs-lisp
(prefer-coding-system 'utf-8)
(setq coding-system-for-read 'utf-8
      coding-system-for-write 'utf-8)
#+END_SRC
** Display options
*** Color theme

Use my custom color theme.

#+BEGIN_SRC emacs-lisp
(load-theme 'ample t)
#+END_SRC
*** Window decorations

Set the window up how we like it.
#+BEGIN_SRC emacs-lisp
(setq-default cursor-type 'bar)

(setq scroll-bar-mode 'right
      use-dialog-box nil
        use-file-dialog nil
        cursor-type 'bar
  )
#+END_SRC
*** Snappier updates

This hack apparently makes things snappier.
#+BEGIN_SRC emacs-lisp
(setq redisplay-dont-pause 1)
#+END_SRC
** Input

*** Clipboard

Let Emacs play with the clipboard.

#+BEGIN_SRC emacs-lisp
(setq x-select-enable-clipboard t)
#+END_SRC
