bew_config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Brett Witty's Emacs configuration</title>
<!-- 2014-03-04 Tue 22:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Brett Witty" />
</head>
<body>
<div id="content">
<h1 class="title">Brett Witty's Emacs configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Configuration</a></li>
<li><a href="#sec-2">2. About me</a>
<ul>
<li><a href="#sec-2-1">2.1. Personal information</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Startup</a>
<ul>
<li><a href="#sec-3-1">3.1. Add my emacs directories</a></li>
<li><a href="#sec-3-2">3.2. Start up configuration</a></li>
<li><a href="#sec-3-3">3.3. Emacs customize</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Global configuration</a>
<ul>
<li><a href="#sec-4-1">4.1. BrettW custom settings</a></li>
<li><a href="#sec-4-2">4.2. Global mode</a></li>
<li><a href="#sec-4-3">4.3. Packages</a></li>
<li><a href="#sec-4-4">4.4. Coding systems</a></li>
<li><a href="#sec-4-5">4.5. Display options</a>
<ul>
<li><a href="#sec-4-5-1">4.5.1. Color theme</a></li>
<li><a href="#sec-4-5-2">4.5.2. Window decorations</a></li>
<li><a href="#sec-4-5-3">4.5.3. Snappier updates</a></li>
</ul>
</li>
<li><a href="#sec-4-6">4.6. Input</a>
<ul>
<li><a href="#sec-4-6-1">4.6.1. Clipboard</a></li>
<li><a href="#sec-4-6-2">4.6.2. Parentheses</a></li>
<li><a href="#sec-4-6-3">4.6.3. Keyboard settings</a></li>
<li><a href="#sec-4-6-4">4.6.4. Mouse settings</a></li>
</ul>
</li>
<li><a href="#sec-4-7">4.7. Backups</a></li>
<li><a href="#sec-4-8">4.8. Recent files</a></li>
<li><a href="#sec-4-9">4.9. Help</a></li>
<li><a href="#sec-4-10">4.10. General completion</a></li>
<li><a href="#sec-4-11">4.11. Filename completion</a>
<ul>
<li><a href="#sec-4-11-1">4.11.1. Ignored extensions</a></li>
</ul>
</li>
<li><a href="#sec-4-12">4.12. Miscellaneous editing options</a>
<ul>
<li><a href="#sec-4-12-1">4.12.1. Disabled warnings</a></li>
<li><a href="#sec-4-12-2">4.12.2. Don't kill scratch</a></li>
<li><a href="#sec-4-12-3">4.12.3. Default directory</a></li>
<li><a href="#sec-4-12-4">4.12.4. Change "yes or no" to "y or n"</a></li>
<li><a href="#sec-4-12-5">4.12.5. Feedback</a></li>
</ul>
</li>
<li><a href="#sec-4-13">4.13. Keys</a>
<ul>
<li><a href="#sec-4-13-1">4.13.1. Unbindings</a></li>
<li><a href="#sec-4-13-2">4.13.2. Bindings</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. Helper functions</a>
<ul>
<li><a href="#sec-5-1">5.1. Byte-compile emacs-lisp files to speed up Emacs loading</a></li>
<li><a href="#sec-5-2">5.2. <code>insert-current-timestamp</code></a></li>
<li><a href="#sec-5-3">5.3. <code>insert-signature</code></a></li>
<li><a href="#sec-5-4">5.4. <code>insert-file-name</code></a></li>
<li><a href="#sec-5-5">5.5. <code>insert-current-directory-name</code></a></li>
<li><a href="#sec-5-6">5.6. <code>rename-file-and-buffer</code></a></li>
<li><a href="#sec-5-7">5.7. <code>reload-buffer</code></a></li>
<li><a href="#sec-5-8">5.8. <code>string-strip-chars</code></a></li>
<li><a href="#sec-5-9">5.9. <code>brettw/resize-window</code></a></li>
<li><a href="#sec-5-10">5.10. <code>brettw/widescreen</code></a>
<ul>
<li><a href="#sec-5-10-1">5.10.1. Startup</a></li>
</ul>
</li>
<li><a href="#sec-5-11">5.11. <code>count-words</code></a></li>
<li><a href="#sec-5-12">5.12. <code>duplicate-line-or-region</code></a></li>
<li><a href="#sec-5-13">5.13. <code>smart-beginning-of-line</code></a></li>
</ul>
</li>
<li><a href="#sec-6">6. Text editing</a>
<ul>
<li><a href="#sec-6-1">6.1. General options</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Diary and calendar</a>
<ul>
<li><a href="#sec-7-1">7.1. Diary</a></li>
<li><a href="#sec-7-2">7.2. General settings</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Org</a>
<ul>
<li><a href="#sec-8-1">8.1. Modules</a></li>
<li><a href="#sec-8-2">8.2. General settings</a>
<ul>
<li><a href="#sec-8-2-1">8.2.1. Comments</a></li>
<li><a href="#sec-8-2-2">8.2.2. Faces</a></li>
</ul>
</li>
<li><a href="#sec-8-3">8.3. Functions</a>
<ul>
<li><a href="#sec-8-3-1">8.3.1. Fix broken schedule/deadline markup</a></li>
<li><a href="#sec-8-3-2">8.3.2. Mark a headline done when all its checkboxes are checked</a></li>
<li><a href="#sec-8-3-3">8.3.3. Jump to journal</a></li>
<li><a href="#sec-8-3-4">8.3.4. Evaluate time range</a></li>
</ul>
</li>
<li><a href="#sec-8-4">8.4. Files and directories</a></li>
<li><a href="#sec-8-5">8.5. Global keyboard shortcuts</a></li>
<li><a href="#sec-8-6">8.6. Babel</a>
<ul>
<li><a href="#sec-8-6-1">8.6.1. Languages</a></li>
<li><a href="#sec-8-6-2">8.6.2. Settings</a></li>
</ul>
</li>
<li><a href="#sec-8-7">8.7. Hyperlinks</a>
<ul>
<li><a href="#sec-8-7-1">8.7.1. Settings</a></li>
<li><a href="#sec-8-7-2">8.7.2. Quicklinks</a></li>
</ul>
</li>
<li><a href="#sec-8-8">8.8. Contacts</a></li>
<li><a href="#sec-8-9">8.9. Agenda</a>
<ul>
<li><a href="#sec-8-9-1">8.9.1. Settings</a></li>
<li><a href="#sec-8-9-2">8.9.2. On load up</a></li>
</ul>
</li>
<li><a href="#sec-8-10">8.10. To-do</a>
<ul>
<li><a href="#sec-8-10-1">8.10.1. Settings</a></li>
</ul>
</li>
<li><a href="#sec-8-11">8.11. <code>org2blog</code></a>
<ul>
<li><a href="#sec-8-11-1">8.11.1. Customization</a></li>
</ul>
</li>
<li><a href="#sec-8-12">8.12. Capture</a></li>
<li><a href="#sec-8-13">8.13. Hooks</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Programming</a>
<ul>
<li><a href="#sec-9-1">9.1. General options</a>
<ul>
<li><a href="#sec-9-1-1">9.1.1. CEDET</a></li>
<li><a href="#sec-9-1-2">9.1.2. Tabs and indents</a></li>
<li><a href="#sec-9-1-3">9.1.3. Compilation</a></li>
<li><a href="#sec-9-1-4">9.1.4. Keys</a></li>
</ul>
</li>
<li><a href="#sec-9-2">9.2. Lisp</a></li>
<li><a href="#sec-9-3">9.3. HTML</a></li>
<li><a href="#sec-9-4">9.4. Python</a>
<ul>
<li><a href="#sec-9-4-1">9.4.1. Filenames</a></li>
<li><a href="#sec-9-4-2">9.4.2. Hook</a></li>
</ul>
</li>
<li><a href="#sec-9-5">9.5. C++</a>
<ul>
<li><a href="#sec-9-5-1">9.5.1. Filenames</a></li>
<li><a href="#sec-9-5-2">9.5.2. Style</a></li>
<li><a href="#sec-9-5-3">9.5.3. Hooks</a></li>
</ul>
</li>
<li><a href="#sec-9-6">9.6. Projects</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Utilities</a>
<ul>
<li><a href="#sec-10-1">10.1. Twitter</a></li>
<li><a href="#sec-10-2">10.2. Webjump</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Configuration</h2>
<div class="outline-text-2" id="text-1">
<p>
This is inspired by Sacha Chua's configuration file.
</p>

<p>
To load this, run <code>(org-babel-load-file "~/bew_config.org")</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> About me</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Personal information</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq user-full-name "Brett Witty"
      user-mail-address "brettwitty@brettwitty.net")
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Startup</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Add my emacs directories</h3>
<div class="outline-text-3" id="text-3-1">
<p>
These are my standard add-on library paths
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path (expand-file-name "~/"))
(add-to-list 'load-path (expand-file-name "~/libraries/"))
(add-to-list 'load-path "~/elisp")
(add-to-list 'load-path "~/libraries/")
(require 'color-theme)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Start up configuration</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Get rid of the startup screen.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq inhibit-startup-screen t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Emacs customize</h3>
<div class="outline-text-3" id="text-3-3">
<p>
It's better to just chuck everything into this file, but sometimes Customize is too easy to use.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq custom-file "~/bew_custom.el")
(load-file custom-file)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Global configuration</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> BrettW custom settings</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defvar brettw/default-screen-width 120)
(defvar brettw/default-screen-height 70)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Global mode</h3>
<div class="outline-text-3" id="text-4-2">
<p>
We like these global modes.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-font-lock-mode t)
(delete-selection-mode t)
(auto-compression-mode t)
(display-time-mode t)
(line-number-mode t)
(show-paren-mode t)
(transient-mark-mode t)
(recentf-mode t)
(global-ede-mode t)
(ido-mode t)
</pre>
</div>

<p>
YASnippet needs some of its own customization.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'yasnippet)
(setq yas/snippet-dirs '("~/snippets" "~/libraries/yasnippet/snippets/" ))
(yas/global-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Packages</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'package-archives
  '("melpa" . "http://melpa.milkbox.net/packages/") t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Coding systems</h3>
<div class="outline-text-3" id="text-4-4">
<p>
We only like UTF-8 because the alternatives are rubbish.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(prefer-coding-system 'utf-8)
(setq coding-system-for-read 'utf-8
      coding-system-for-write 'utf-8)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Display options</h3>
<div class="outline-text-3" id="text-4-5">
</div><div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> Color theme</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
Use my custom color theme.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(load-theme 'ample t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2"><span class="section-number-4">4.5.2</span> Window decorations</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
Set the window up how we like it.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default cursor-type 'bar)

(setq scroll-bar-mode 'right
      use-dialog-box nil
        use-file-dialog nil
        cursor-type 'bar
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-5-3" class="outline-4">
<h4 id="sec-4-5-3"><span class="section-number-4">4.5.3</span> Snappier updates</h4>
<div class="outline-text-4" id="text-4-5-3">
<p>
This hack apparently makes things snappier.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq redisplay-dont-pause 1)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Input</h3>
<div class="outline-text-3" id="text-4-6">
</div><div id="outline-container-sec-4-6-1" class="outline-4">
<h4 id="sec-4-6-1"><span class="section-number-4">4.6.1</span> Clipboard</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
Let Emacs play with the clipboard.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq x-select-enable-clipboard t)
</pre>
</div>
</div>
</div>
