bew_config.org
*** Parentheses

Use the shiny autopair module.
#+BEGIN_SRC emacs-lisp
(require 'autopair)
(autopair-global-mode 1)
#+END_SRC
*** Keyboard settings

I'd like these Windows keys to work, but they don't.

#+BEGIN_SRC emacs-lisp
(w32-register-hot-key [A-tab])
(w32-register-hot-key [s-o])
#+END_SRC
*** Mouse settings

Get the right amount of mouse scrolling.

#+BEGIN_SRC emacs-lisp
(setq mouse-wheel-scroll-amount '(1)
      mouse-wheel-scroll-progressive-speed nil)
#+END_SRC
** Backups

We want to control and minimize Emacs backups.

#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist `(("." . "~/backup/")))
(setq backup-by-copying t
      delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t)
#+END_SRC
** Recent files

Set up the recent files.

#+BEGIN_SRC emacs-lisp
(setq recentf-menu-path nil
      recentf-menu-title "Recent files"
      recentf-max-saved-items 100)

(add-to-list 'recentf-exclude "\\.ido\\.last\\'")
(add-to-list 'recentf-exclude ".*\\.el\\'")
(add-to-list 'recentf-exclude "archive-contents\\'")
(add-to-list 'recentf-exclude "checksums\\.dat\\'")
#+END_SRC
** Help

We customize help just a tad.
#+BEGIN_SRC emacs-lisp
(setq apropos-compact-layout t
      apropos-do-all t
      help-window-select t)
#+END_SRC
** General completion

#+BEGIN_SRC emacs-lisp
(add-hook 'minibuffer-exit-hook
          '(lambda ()
             (let ((buffer "*Completions*"))
               (and (get-buffer buffer)
                    (kill-buffer buffer)))
))
#+END_SRC
** Filename completion

*** Ignored extensions

Ignore these files because we're unlikely to open them in Emacs.

#+BEGIN_SRC emacs-lisp
(setq completion-ignored-extensions
      '(".o" ".elc" "~" ".bin" ".dvi" ".toc" ".aux" ".ps" ".blg" ".bbl" ".idx"))
#+END_SRC
** Miscellaneous editing options
*** Disabled warnings

#+BEGIN_SRC emacs-lisp
(put 'downcase-region 'disabled nil)
#+END_SRC
*** Don't kill scratch

#+BEGIN_SRC emacs-lisp
(defadvice kill-buffer (around kill-buffer-around-advice activate)
  (let ((buffer-to-kill (ad-get-arg 0)))
    (if (equal buffer-to-kill "*scratch*")
        (bury-buffer)
      ad-do-it))
)
#+END_SRC
*** Default directory

#+BEGIN_SRC emacs-lisp
(setq default-directory "~/")
#+END_SRC
*** Change "yes or no" to "y or n"

#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC
*** Feedback

Don't flash at me.

#+BEGIN_SRC emacs-lisp
(setq visible-bell nil)
#+END_SRC

Don't truncate lines in the message log.

#+BEGIN_SRC emacs-lisp
(setq message-log-max t)
#+END_SRC
** Keys

*** Unbindings

Out of the box, I find these distasteful.

#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x C-n"))
(global-unset-key (kbd "C-_"))
(global-unset-key (kbd "<C-next>"))
(global-unset-key (kbd "<C-previous>"))
(global-unset-key (kbd "C-z"))
#+END_SRC
*** Bindings

These are globally useful things.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x C-M-f") 'find-file-at-point)

(global-set-key (kbd "<C-kp-add>") 'text-scale-increase)
(global-set-key (kbd "<C-kp-subtract>") 'text-scale-decrease)

(global-set-key (kbd "C-`") 'brettw/widescreen)
(global-set-key (kbd "C-c d") 'brettw/duplicate-line-or-region)

(global-set-key (kbd "<home>") 'smart-beginning-of-line)
#+END_SRC

I use these on Linux systems, but can't on Windows.
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "<s-up>") 'windmove-up)
(global-set-key (kbd "<s-down>") 'windmove-down)
(global-set-key (kbd "<s-left>") 'windmove-left)
(global-set-key (kbd "<s-right>") 'windmove-right)
#+END_SRC


Run an eshell from anywhere.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-M-s") 'eshell)
#+END_SRC
* Helper functions

Here's a bunch of minimal, globally-useful functions.

** Byte-compile emacs-lisp files to speed up Emacs loading

#+BEGIN_SRC emacs-lisp
(defun brettw/byte-recompile ()
  (interactive)
  (byte-recompile-directory "~/emacs" 0)
)
#+END_SRC
** =insert-current-timestamp=

Insert the current timestamp in Year-month-day format.

#+BEGIN_SRC emacs-lisp
(defun insert-current-timestamp ()
  "Spit out the current time in Y-m-d format."
  (interactive)
  (insert (format-time-string "%Y-%m-%d"))
)
#+END_SRC
** =insert-signature=

Insert a textual signature into a file.

#+BEGIN_SRC emacs-lisp
(defun insert-signature ()
  "Spit out my name, email and current time."
  (interactive)
  (insert "-- " user-full-name " (" user-mail-address ")  ")
  (insert-current-timestamp)
)
#+END_SRC
** =insert-file-name=

Ask/browse for a filename and insert it into the buffer at the point.

#+BEGIN_SRC emacs-lisp
(defun insert-file-name (file &optional relativep)
  "Read file name and insert it at point.
With a prefix argument, insert only the non-directory part."
  (interactive "fFile: \nP")
  (when relativep (setq file (file-name-nondirectory file)))
  (insert file))
#+END_SRC
** =insert-current-directory-name=

Insert the name of the current directory.

#+BEGIN_SRC emacs-lisp
(defun insert-current-directory-name ()
  "Insert the name of the current directory."
  (interactive)
  (insert (file-name-directory (buffer-file-name)))
)
#+END_SRC
