bew_config.html

<div id="outline-container-sec-4-6-2" class="outline-4">
<h4 id="sec-4-6-2"><span class="section-number-4">4.6.2</span> Parentheses</h4>
<div class="outline-text-4" id="text-4-6-2">
<p>
Use the shiny autopair module.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'autopair)
(autopair-global-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-6-3" class="outline-4">
<h4 id="sec-4-6-3"><span class="section-number-4">4.6.3</span> Keyboard settings</h4>
<div class="outline-text-4" id="text-4-6-3">
<p>
I'd like these Windows keys to work, but they don't.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(w32-register-hot-key [A-tab])
(w32-register-hot-key [s-o])
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-6-4" class="outline-4">
<h4 id="sec-4-6-4"><span class="section-number-4">4.6.4</span> Mouse settings</h4>
<div class="outline-text-4" id="text-4-6-4">
<p>
Get the right amount of mouse scrolling.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq mouse-wheel-scroll-amount '(1)
      mouse-wheel-scroll-progressive-speed nil)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Backups</h3>
<div class="outline-text-3" id="text-4-7">
<p>
We want to control and minimize Emacs backups.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq backup-directory-alist `(("." . "~/backup/")))
(setq backup-by-copying t
      delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> Recent files</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Set up the recent files.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq recentf-menu-path nil
      recentf-menu-title "Recent files"
      recentf-max-saved-items 100)

(add-to-list 'recentf-exclude "\\.ido\\.last\\'")
(add-to-list 'recentf-exclude ".*\\.el\\'")
(add-to-list 'recentf-exclude "archive-contents\\'")
(add-to-list 'recentf-exclude "checksums\\.dat\\'")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> Help</h3>
<div class="outline-text-3" id="text-4-9">
<p>
We customize help just a tad.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq apropos-compact-layout t
      apropos-do-all t
      help-window-select t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-10" class="outline-3">
<h3 id="sec-4-10"><span class="section-number-3">4.10</span> General completion</h3>
<div class="outline-text-3" id="text-4-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'minibuffer-exit-hook
          '(lambda ()
             (let ((buffer "*Completions*"))
               (and (get-buffer buffer)
                    (kill-buffer buffer)))
))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-11" class="outline-3">
<h3 id="sec-4-11"><span class="section-number-3">4.11</span> Filename completion</h3>
<div class="outline-text-3" id="text-4-11">
</div><div id="outline-container-sec-4-11-1" class="outline-4">
<h4 id="sec-4-11-1"><span class="section-number-4">4.11.1</span> Ignored extensions</h4>
<div class="outline-text-4" id="text-4-11-1">
<p>
Ignore these files because we're unlikely to open them in Emacs.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq completion-ignored-extensions
      '(".o" ".elc" "~" ".bin" ".dvi" ".toc" ".aux" ".ps" ".blg" ".bbl" ".idx"))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4-12" class="outline-3">
<h3 id="sec-4-12"><span class="section-number-3">4.12</span> Miscellaneous editing options</h3>
<div class="outline-text-3" id="text-4-12">
</div><div id="outline-container-sec-4-12-1" class="outline-4">
<h4 id="sec-4-12-1"><span class="section-number-4">4.12.1</span> Disabled warnings</h4>
<div class="outline-text-4" id="text-4-12-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(put 'downcase-region 'disabled nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-12-2" class="outline-4">
<h4 id="sec-4-12-2"><span class="section-number-4">4.12.2</span> Don't kill scratch</h4>
<div class="outline-text-4" id="text-4-12-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defadvice kill-buffer (around kill-buffer-around-advice activate)
  (let ((buffer-to-kill (ad-get-arg 0)))
    (if (equal buffer-to-kill "*scratch*")
        (bury-buffer)
      ad-do-it))
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-12-3" class="outline-4">
<h4 id="sec-4-12-3"><span class="section-number-4">4.12.3</span> Default directory</h4>
<div class="outline-text-4" id="text-4-12-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq default-directory "~/")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-12-4" class="outline-4">
<h4 id="sec-4-12-4"><span class="section-number-4">4.12.4</span> Change "yes or no" to "y or n"</h4>
<div class="outline-text-4" id="text-4-12-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(fset 'yes-or-no-p 'y-or-n-p)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-12-5" class="outline-4">
<h4 id="sec-4-12-5"><span class="section-number-4">4.12.5</span> Feedback</h4>
<div class="outline-text-4" id="text-4-12-5">
<p>
Don't flash at me.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq visible-bell nil)
</pre>
</div>

<p>
Don't truncate lines in the message log.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq message-log-max t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4-13" class="outline-3">
<h3 id="sec-4-13"><span class="section-number-3">4.13</span> Keys</h3>
<div class="outline-text-3" id="text-4-13">
</div><div id="outline-container-sec-4-13-1" class="outline-4">
<h4 id="sec-4-13-1"><span class="section-number-4">4.13.1</span> Unbindings</h4>
<div class="outline-text-4" id="text-4-13-1">
<p>
Out of the box, I find these distasteful.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-unset-key (kbd "C-x C-n"))
(global-unset-key (kbd "C-_"))
(global-unset-key (kbd "&lt;C-next&gt;"))
(global-unset-key (kbd "&lt;C-previous&gt;"))
(global-unset-key (kbd "C-z"))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-13-2" class="outline-4">
<h4 id="sec-4-13-2"><span class="section-number-4">4.13.2</span> Bindings</h4>
<div class="outline-text-4" id="text-4-13-2">
<p>
These are globally useful things.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd "C-x C-M-f") 'find-file-at-point)

(global-set-key (kbd "&lt;C-kp-add&gt;") 'text-scale-increase)
(global-set-key (kbd "&lt;C-kp-subtract&gt;") 'text-scale-decrease)

(global-set-key (kbd "C-`") 'brettw/widescreen)
(global-set-key (kbd "C-c d") 'brettw/duplicate-line-or-region)

(global-set-key (kbd "&lt;home&gt;") 'smart-beginning-of-line)
</pre>
</div>

<p>
I use these on Linux systems, but can't on Windows.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd "&lt;s-up&gt;") 'windmove-up)
(global-set-key (kbd "&lt;s-down&gt;") 'windmove-down)
(global-set-key (kbd "&lt;s-left&gt;") 'windmove-left)
(global-set-key (kbd "&lt;s-right&gt;") 'windmove-right)
</pre>
</div>


<p>
Run an eshell from anywhere.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd "C-M-s") 'eshell)
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Helper functions</h2>
<div class="outline-text-2" id="text-5">
<p>
Here's a bunch of minimal, globally-useful functions.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Byte-compile emacs-lisp files to speed up Emacs loading</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun brettw/byte-recompile ()
  (interactive)
  (byte-recompile-directory "~/emacs" 0)
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> <code>insert-current-timestamp</code></h3>
<div class="outline-text-3" id="text-5-2">
<p>
Insert the current timestamp in Year-month-day format.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun insert-current-timestamp ()
  "Spit out the current time in Y-m-d format."
  (interactive)
  (insert (format-time-string "%Y-%m-%d"))
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> <code>insert-signature</code></h3>
<div class="outline-text-3" id="text-5-3">
<p>
Insert a textual signature into a file.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun insert-signature ()
  "Spit out my name, email and current time."
  (interactive)
  (insert "-- " user-full-name " (" user-mail-address ")  ")
  (insert-current-timestamp)
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> <code>insert-file-name</code></h3>
<div class="outline-text-3" id="text-5-4">
<p>
Ask/browse for a filename and insert it into the buffer at the point.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun insert-file-name (file &amp;optional relativep)
  "Read file name and insert it at point.
With a prefix argument, insert only the non-directory part."
  (interactive "fFile: \nP")
  (when relativep (setq file (file-name-nondirectory file)))
  (insert file))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> <code>insert-current-directory-name</code></h3>
<div class="outline-text-3" id="text-5-5">
<p>
Insert the name of the current directory.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun insert-current-directory-name ()
  "Insert the name of the current directory."
  (interactive)
  (insert (file-name-directory (buffer-file-name)))
)
</pre>
</div>
</div>
</div>
