bew_config.org
** =rename-file-and-buffer=

I've stolen this from Steve Yegge. It renames the current file and buffer.

#+BEGIN_SRC emacs-lisp
(defun rename-file-and-buffer (new-name)
  "Rename both current buffer and file it's visiting to NEW-NAME."
  (interactive "sNew name: ")
  (let ((name (buffer-name))
        (filename (buffer-file-name)))
    (if (not filename)
        (message "Buffer '%s' is not visiting a file!" name)
      (if (get-buffer new-name)
          (message "A buffer named '%s' already exists!" new-name)
        (progn
          (rename-file name new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modifier-p nil)
          ))))
)
#+END_SRC
** =reload-buffer=

This reverts a buffer without confirmation.
#+BEGIN_SRC emacs-lisp
(defun reload-buffer ()
  "revert-buffer without confirmation."
  (interactive)
  (revert-buffer t t))
#+END_SRC
** =string-strip-chars=

Take a string and strip out all the characters from a second string.

#+BEGIN_SRC emacs-lisp
(defun string-strip-chars (string strip)
  "Take STRING and remove characters in STRIP."
  (while (> (length strip) 0)
    (let ((pos 0))
      (setq pos (string-match (substring strip 0 1) string pos))
      (while (not (eq pos nil))
        (setq string (concat (substring string 0 pos)
                             (substring string (+ pos 1))))
        (setq pos (string-match (substring strip 0 1) string pos)))
      (setq strip (substring strip 1))))
  string)
#+END_SRC

** =brettw/resize-window=

This resizes the current window to the "correct" size.

#+BEGIN_SRC emacs-lisp
(defun brettw/resize-window ()
  "Resize the frame to defaults."
  (interactive)
  (if (window-system)
      (set-frame-size (selected-frame) brettw/default-screen-width brettw/default-screen-height)
    )
  )
#+END_SRC
** =brettw/widescreen=

Resize the current window to double the normal width.

#+BEGIN_SRC emacs-lisp
(defun brettw/widescreen ()
  "Resize the frame to defaults."
  (interactive)
  (if (= (frame-width) brettw/default-screen-width)
      (progn
        (set-frame-size (selected-frame) (* 2 brettw/default-screen-width) brettw/default-screen-height)
        (split-window-horizontally)
        )
    (progn 
      (set-frame-size (selected-frame) brettw/default-screen-width brettw/default-screen-height)
      (delete-other-windows)
      )
    )
  )
#+END_SRC


*** Startup

We typically want this during startup, so let's call it now.

#+BEGIN_SRC emacs-lisp
(brettw/resize-window)
#+END_SRC
** =count-words=

#+BEGIN_SRC emacs-lisp
(defun count-words ()
  (interactive)
  (message "%d words"
           (if (use-region-p)
               (how-many "\\<\\w*\\>" (region-beginning) (region-end))
             (how-many "\\<\\w*\\>" (buffer-end -1) (buffer-end 1))
             )
           )
)
#+END_SRC
** =duplicate-line-or-region=

#+BEGIN_SRC emacs-lisp
(defun brettw/duplicate-line-or-region (&optional n)
  "Duplicate current line, or region if active.
With argument N, make N copies.
With negative N, comment out original line and use the absolute value."
  (interactive "*p")
  (let ((use-region (use-region-p)))
    (save-excursion
      (let ((text (if use-region
                      (buffer-substring (region-beginning) (region-end))
                    (prog1 (thing-at-point 'line)
                      (end-of-line)
                      (if (< 0 (forward-line 1))
                          (newline))))))
        (dotimes (i (abs (or n 1)))
          (insert text))))
    (if use-region nil
      (let ((pos (- (point) (line-beginning-position))))
        (if (> 0 n)
            (comment-region (line-beginning-position) (line-end-position)))
        (forward-line 1)
        (forward-char pos)))))
#+END_SRC
** =smart-beginning-of-line=

I stole this from [[http://stackoverflow.com/a/145359]]

#+BEGIN_SRC emacs-lisp
(defun smart-beginning-of-line ()
  "Move point to first non-whitespace character or beginning-of-line.

Move point to the first non-whitespace character on this line.
If point was already at that position, move point to beginning of line."
  (interactive "^")
  (let ((oldpos (point)))
    (back-to-indentation)
    (and (= oldpos (point))
         (beginning-of-line))))
#+END_SRC

* Text editing
** General options

Sentences should only have a single space at the end.

#+BEGIN_SRC emacs-lisp
(setq sentence-end-double-space nil)
#+END_SRC

* Diary and calendar

** Diary

My diary is at =~/diary/main.txt=, and anything in the =/diary/= directory is also diary-related.

#+BEGIN_SRC emacs-lisp
(setq diary-file "~/diary/main.txt")
(add-to-list 'auto-mode-alist `(,(expand-file-name "~/org/diary/") . diary-mode))
#+END_SRC
** General settings

#+BEGIN_SRC emacs-lisp
(setq calendar-date-style 'european)

(add-hook 'diary-list-entries-hook 'diary-sort-entries t)
(add-hook 'diary-list-entries-hook 'diary-include-other-diary-files)
(add-hook 'diary-mark-entries-hook 'diary-mark-included-diary-files)
#+END_SRC
* Org

** Modules

#+BEGIN_SRC emacs-lisp
(setq org-modules '(
                    org-bibtex
                    org-e-beamer
                    org-expiry
                    org-habit
                    org-info
                    org-interactive-query
                    org-mouse
                    org-toc
                    )
      )
#+END_SRC

We require the mighty org-babel module.

#+BEGIN_SRC emacs-lisp
(require 'ob)
#+END_SRC
** General settings

These are a few miscellaneous settings to make things work how I like them.

#+BEGIN_SRC emacs-lisp
(setq org-log-into-drawer t
      org-log-states-order-reversed nil
      org-support-shift-select t
      org-tags-sort-function (quote string<)
      org-yank-adjusted-subtrees t
      org-startup-with-inline-images nil
      org-startup-folded nil

      org-refile 'time
      org-log-reschedule 'time

      org-use-speed-commands t
)
#+END_SRC

