bew_config.html

<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> <code>rename-file-and-buffer</code></h3>
<div class="outline-text-3" id="text-5-6">
<p>
I've stolen this from Steve Yegge. It renames the current file and buffer.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun rename-file-and-buffer (new-name)
  "Rename both current buffer and file it's visiting to NEW-NAME."
  (interactive "sNew name: ")
  (let ((name (buffer-name))
        (filename (buffer-file-name)))
    (if (not filename)
        (message "Buffer '%s' is not visiting a file!" name)
      (if (get-buffer new-name)
          (message "A buffer named '%s' already exists!" new-name)
        (progn
          (rename-file name new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modifier-p nil)
          ))))
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> <code>reload-buffer</code></h3>
<div class="outline-text-3" id="text-5-7">
<p>
This reverts a buffer without confirmation.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun reload-buffer ()
  "revert-buffer without confirmation."
  (interactive)
  (revert-buffer t t))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> <code>string-strip-chars</code></h3>
<div class="outline-text-3" id="text-5-8">
<p>
Take a string and strip out all the characters from a second string.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun string-strip-chars (string strip)
  "Take STRING and remove characters in STRIP."
  (while (&gt; (length strip) 0)
    (let ((pos 0))
      (setq pos (string-match (substring strip 0 1) string pos))
      (while (not (eq pos nil))
        (setq string (concat (substring string 0 pos)
                             (substring string (+ pos 1))))
        (setq pos (string-match (substring strip 0 1) string pos)))
      (setq strip (substring strip 1))))
  string)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> <code>brettw/resize-window</code></h3>
<div class="outline-text-3" id="text-5-9">
<p>
This resizes the current window to the "correct" size.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun brettw/resize-window ()
  "Resize the frame to defaults."
  (interactive)
  (if (window-system)
      (set-frame-size (selected-frame) brettw/default-screen-width brettw/default-screen-height)
    )
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-10" class="outline-3">
<h3 id="sec-5-10"><span class="section-number-3">5.10</span> <code>brettw/widescreen</code></h3>
<div class="outline-text-3" id="text-5-10">
<p>
Resize the current window to double the normal width.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun brettw/widescreen ()
  "Resize the frame to defaults."
  (interactive)
  (if (= (frame-width) brettw/default-screen-width)
      (progn
        (set-frame-size (selected-frame) (* 2 brettw/default-screen-width) brettw/default-screen-height)
        (split-window-horizontally)
        )
    (progn 
      (set-frame-size (selected-frame) brettw/default-screen-width brettw/default-screen-height)
      (delete-other-windows)
      )
    )
  )
</pre>
</div>
</div>


<div id="outline-container-sec-5-10-1" class="outline-4">
<h4 id="sec-5-10-1"><span class="section-number-4">5.10.1</span> Startup</h4>
<div class="outline-text-4" id="text-5-10-1">
<p>
We typically want this during startup, so let's call it now.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(brettw/resize-window)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5-11" class="outline-3">
<h3 id="sec-5-11"><span class="section-number-3">5.11</span> <code>count-words</code></h3>
<div class="outline-text-3" id="text-5-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun count-words ()
  (interactive)
  (message "%d words"
           (if (use-region-p)
               (how-many "\\&lt;\\w*\\&gt;" (region-beginning) (region-end))
             (how-many "\\&lt;\\w*\\&gt;" (buffer-end -1) (buffer-end 1))
             )
           )
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-12" class="outline-3">
<h3 id="sec-5-12"><span class="section-number-3">5.12</span> <code>duplicate-line-or-region</code></h3>
<div class="outline-text-3" id="text-5-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun brettw/duplicate-line-or-region (&amp;optional n)
  "Duplicate current line, or region if active.
With argument N, make N copies.
With negative N, comment out original line and use the absolute value."
  (interactive "*p")
  (let ((use-region (use-region-p)))
    (save-excursion
      (let ((text (if use-region
                      (buffer-substring (region-beginning) (region-end))
                    (prog1 (thing-at-point 'line)
                      (end-of-line)
                      (if (&lt; 0 (forward-line 1))
                          (newline))))))
        (dotimes (i (abs (or n 1)))
          (insert text))))
    (if use-region nil
      (let ((pos (- (point) (line-beginning-position))))
        (if (&gt; 0 n)
            (comment-region (line-beginning-position) (line-end-position)))
        (forward-line 1)
        (forward-char pos)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-13" class="outline-3">
<h3 id="sec-5-13"><span class="section-number-3">5.13</span> <code>smart-beginning-of-line</code></h3>
<div class="outline-text-3" id="text-5-13">
<p>
I stole this from <a href="http://stackoverflow.com/a/145359">http://stackoverflow.com/a/145359</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun smart-beginning-of-line ()
  "Move point to first non-whitespace character or beginning-of-line.

Move point to the first non-whitespace character on this line.
If point was already at that position, move point to beginning of line."
  (interactive "^")
  (let ((oldpos (point)))
    (back-to-indentation)
    (and (= oldpos (point))
         (beginning-of-line))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Text editing</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> General options</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Sentences should only have a single space at the end.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq sentence-end-double-space nil)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Diary and calendar</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Diary</h3>
<div class="outline-text-3" id="text-7-1">
<p>
My diary is at <code>~/diary/main.txt</code>, and anything in the <code>/diary/</code> directory is also diary-related.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq diary-file "~/diary/main.txt")
(add-to-list 'auto-mode-alist `(,(expand-file-name "~/org/diary/") . diary-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> General settings</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq calendar-date-style 'european)

(add-hook 'diary-list-entries-hook 'diary-sort-entries t)
(add-hook 'diary-list-entries-hook 'diary-include-other-diary-files)
(add-hook 'diary-mark-entries-hook 'diary-mark-included-diary-files)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Org</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Modules</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-modules '(
                    org-bibtex
                    org-e-beamer
                    org-expiry
                    org-habit
                    org-info
                    org-interactive-query
                    org-mouse
                    org-toc
                    )
      )
</pre>
</div>

<p>
We require the mighty org-babel module.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'ob)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> General settings</h3>
<div class="outline-text-3" id="text-8-2">
<p>
These are a few miscellaneous settings to make things work how I like them.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-log-into-drawer t
      org-log-states-order-reversed nil
      org-support-shift-select t
      org-tags-sort-function (quote string&lt;)
      org-yank-adjusted-subtrees t
      org-startup-with-inline-images nil
      org-startup-folded nil

      org-refile 'time
      org-log-reschedule 'time

      org-use-speed-commands t
)
</pre>
</div>
</div>
