bew_config.org
*** Comments

#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist '("C" "#+BEGIN_COMMENT\n\n#+END_COMMENT" "<!--\n\n-->"))
#+END_SRC

*** Faces

#+BEGIN_SRC emacs-lisp
(eval-after-load 'org-faces
 '(progn
    (defcustom org-todo-keyword-faces nil
      "Faces for specific TODO keywords.
This is a list of cons cells, with TODO keywords in the car and
faces in the cdr.  The face can be a symbol, a color, or a
property list of attributes, like (:foreground \"blue\" :weight
bold :underline t)."
      :group 'org-faces
      :group 'org-todo
      :type '(repeat
              (cons
               (string :tag "Keyword")
               (choice color (sexp :tag "Face")))))))

(eval-after-load 'org
 '(progn
    (defun org-get-todo-face-from-color (color)
      "Returns a specification for a face that inherits from org-todo
 face and has the given color as foreground. Returns nil if
 color is nil."
      (when color
        `(:inherit org-warning :foreground ,color)))

    (defun org-get-todo-face (kwd)
      "Get the right face for a TODO keyword KWD.
If KWD is a number, get the corresponding match group."
      (if (numberp kwd) (setq kwd (match-string kwd)))
      (or (let ((face (cdr (assoc kwd org-todo-keyword-faces))))
            (if (stringp face)
                (org-get-todo-face-from-color face)
              face))
          (and (member kwd org-done-keywords) 'org-done)
          'org-todo))))
#+END_SRC

Now the actual settings:

#+BEGIN_SRC emacs-lisp
(setq org-todo-keyword-faces
      '(("STARTED" . "dark orange")
        ("WAITING" . "red4")
        ("CANCELLED" . "saddle brown"))
)
#+END_SRC
** Functions

Many of these functions are taken from [[http://orgmode.org/worg/index.html][Worg]].

*** Fix broken schedule/deadline markup

This will repair broken SCHEDULED and DEADLINE markup.

#+BEGIN_SRC emacs-lisp
(defun org-check-misformatted-subtree ()
  "Check misformatted entries in the current buffer."
  (interactive)
  (show-all)
  (org-map-entries
   (lambda ()
     (when (and (move-beginning-of-line 2)
                (not (looking-at org-heading-regexp)))
       (if (or (and (org-get-scheduled-time (point))
                    (not (looking-at (concat "^.*" org-scheduled-regexp))))
               (and (org-get-deadline-time (point))
                    (not (looking-at (concat "^.*" org-deadline-regexp)))))
           (when (y-or-n-p "Fix this subtree? ")
             (message "Call the function again when you're done fixing this subtree.")
             (recursive-edit))
         (message "All subtrees checked."))))))
#+END_SRC
*** Mark a headline done when all its checkboxes are checked

#+BEGIN_SRC emacs-lisp
(eval-after-load 'org-list
  '(add-hook 'org-checkbox-statistics-hook (function brettw/checkbox-list-complete)))

(defun brettw/checkbox-list-complete ()
  (save-excursion
    (org-back-to-heading t)
    (let ((beg (point)) end)
      (end-of-line)
      (setq end (point))
      (goto-char beg)
      (if (re-search-forward "\\[\\([0-9]*%\\)\\]\\|\\[\\([0-9]*\\)/\\([0-9]*\\)\\]" end t)
            (if (match-end 1)
                (if (equal (match-string 1) "100%")
                    ;; all done - do the state change
                    (org-todo 'done)
                  (org-todo 'todo))
              (if (and (> (match-end 2) (match-beginning 2))
                       (equal (match-string 2) (match-string 3)))
                  (org-todo 'done)
                (org-todo 'todo)))))))
#+END_SRC
*** Jump to journal

#+BEGIN_SRC emacs-lisp
(defun brettw/jump-to-journal ()
  (interactive)
  (find-file brettw/org-journal-file)
)
#+END_SRC
*** Evaluate time range

#+BEGIN_SRC emacs-lisp
(defun brettw/org-evaluate-time-range (&optional to-buffer)
  (interactive)
  (if (org-at-date-range-p t)
      (org-evaluate-time-range to-buffer)
    (let ((headline (buffer-substring (point-at-bol) (point-at-eol))))
      (with-temp-buffer
        (insert headline)
        (goto-char (point-at-bol))
        (re-search-forward org-ts-regexp (point-at-eol) t)
        (if (not (org-at-timestamp-p t))
            (error "No timestamp here"))
        (goto-char (match-beginning 0))
        (org-insert-time-stamp (current-time) nil nil)
        (insert "--")
        (org-evaluate-time-range to-buffer)))))
#+END_SRC
** Files and directories

We typically work out of the =~/org/= directory for the universal stuff.

#+BEGIN_SRC emacs-lisp
(setq org-directory "~/org")
(setq brettw/org-journal-file "~/org/journal.org")
(setq org-agenda-files (list "~/org/" "~/"))
(setq org-default-notes-file (concat org-directory "/notes.org"))
#+END_SRC
** Global keyboard shortcuts

So ~org-mode~ can be accessed from anywhere!

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "\C-c l") 'org-store-link)
(global-set-key (kbd "\C-c a") 'org-agenda)
(global-set-key (kbd "\C-c b") 'org-iswitchb)
(global-set-key (kbd "\C-c c") 'org-capture)
(global-set-key (kbd "C-M-j") 'brettw/jump-to-journal)
#+END_SRC
** Babel

*** Languages

We'll usually only work on my favourite languages.

#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (C . t)
   (dot . t)
   (emacs-lisp . t)
   (latex . t)
   (python . t)
   )
)
#+END_SRC
*** Settings

I'd prefer zero indentation.

#+BEGIN_SRC emacs-lisp
(setq org-edit-src-content-indentation 0)
#+END_SRC
** Hyperlinks

*** Settings

#+BEGIN_SRC emacs-lisp
(setq org-return-follows-link t
      org-tab-follows-link t)

(setq org-link-frame-setup '((vm . vm-visit-folder-other-frame)
                             (vm-imap . vm-visit-imap-folder-other-frame)
                             (gnus . org-gnus-no-new-news)
                             (file . find-file)
                             (wl . wl-other-frame))
)
#+END_SRC
*** Quicklinks
:PROPERTIES:
:ID:       23a1353e-326a-49d3-93d3-8f2a127d5871
:END:

#+BEGIN_SRC emacs-lisp
(setq org-link-abbrev-alist
      '(
        ("wikipedia" . "http://en.wikipedia.org/index.php?search=%h")
        ("contact" . "file:~/org/contacts.org::%s")
        )
)
#+END_SRC
