bew_config.html

<div id="outline-container-sec-8-2-1" class="outline-4">
<h4 id="sec-8-2-1"><span class="section-number-4">8.2.1</span> Comments</h4>
<div class="outline-text-4" id="text-8-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'org-structure-template-alist '("C" "#+BEGIN_COMMENT\n\n#+END_COMMENT" "&lt;!--\n\n--&gt;"))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-2-2" class="outline-4">
<h4 id="sec-8-2-2"><span class="section-number-4">8.2.2</span> Faces</h4>
<div class="outline-text-4" id="text-8-2-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-load 'org-faces
 '(progn
    (defcustom org-todo-keyword-faces nil
      "Faces for specific TODO keywords.
This is a list of cons cells, with TODO keywords in the car and
faces in the cdr.  The face can be a symbol, a color, or a
property list of attributes, like (:foreground \"blue\" :weight
bold :underline t)."
      :group 'org-faces
      :group 'org-todo
      :type '(repeat
              (cons
               (string :tag "Keyword")
               (choice color (sexp :tag "Face")))))))

(eval-after-load 'org
 '(progn
    (defun org-get-todo-face-from-color (color)
      "Returns a specification for a face that inherits from org-todo
 face and has the given color as foreground. Returns nil if
 color is nil."
      (when color
        `(:inherit org-warning :foreground ,color)))

    (defun org-get-todo-face (kwd)
      "Get the right face for a TODO keyword KWD.
If KWD is a number, get the corresponding match group."
      (if (numberp kwd) (setq kwd (match-string kwd)))
      (or (let ((face (cdr (assoc kwd org-todo-keyword-faces))))
            (if (stringp face)
                (org-get-todo-face-from-color face)
              face))
          (and (member kwd org-done-keywords) 'org-done)
          'org-todo))))
</pre>
</div>

<p>
Now the actual settings:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-todo-keyword-faces
      '(("STARTED" . "dark orange")
        ("WAITING" . "red4")
        ("CANCELLED" . "saddle brown"))
)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Functions</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Many of these functions are taken from <a href="http://orgmode.org/worg/index.html">Worg</a>.
</p>
</div>

<div id="outline-container-sec-8-3-1" class="outline-4">
<h4 id="sec-8-3-1"><span class="section-number-4">8.3.1</span> Fix broken schedule/deadline markup</h4>
<div class="outline-text-4" id="text-8-3-1">
<p>
This will repair broken SCHEDULED and DEADLINE markup.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-check-misformatted-subtree ()
  "Check misformatted entries in the current buffer."
  (interactive)
  (show-all)
  (org-map-entries
   (lambda ()
     (when (and (move-beginning-of-line 2)
                (not (looking-at org-heading-regexp)))
       (if (or (and (org-get-scheduled-time (point))
                    (not (looking-at (concat "^.*" org-scheduled-regexp))))
               (and (org-get-deadline-time (point))
                    (not (looking-at (concat "^.*" org-deadline-regexp)))))
           (when (y-or-n-p "Fix this subtree? ")
             (message "Call the function again when you're done fixing this subtree.")
             (recursive-edit))
         (message "All subtrees checked."))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-3-2" class="outline-4">
<h4 id="sec-8-3-2"><span class="section-number-4">8.3.2</span> Mark a headline done when all its checkboxes are checked</h4>
<div class="outline-text-4" id="text-8-3-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-load 'org-list
  '(add-hook 'org-checkbox-statistics-hook (function brettw/checkbox-list-complete)))

(defun brettw/checkbox-list-complete ()
  (save-excursion
    (org-back-to-heading t)
    (let ((beg (point)) end)
      (end-of-line)
      (setq end (point))
      (goto-char beg)
      (if (re-search-forward "\\[\\([0-9]*%\\)\\]\\|\\[\\([0-9]*\\)/\\([0-9]*\\)\\]" end t)
            (if (match-end 1)
                (if (equal (match-string 1) "100%")
                    ;; all done - do the state change
                    (org-todo 'done)
                  (org-todo 'todo))
              (if (and (&gt; (match-end 2) (match-beginning 2))
                       (equal (match-string 2) (match-string 3)))
                  (org-todo 'done)
                (org-todo 'todo)))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-3-3" class="outline-4">
<h4 id="sec-8-3-3"><span class="section-number-4">8.3.3</span> Jump to journal</h4>
<div class="outline-text-4" id="text-8-3-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun brettw/jump-to-journal ()
  (interactive)
  (find-file brettw/org-journal-file)
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-3-4" class="outline-4">
<h4 id="sec-8-3-4"><span class="section-number-4">8.3.4</span> Evaluate time range</h4>
<div class="outline-text-4" id="text-8-3-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun brettw/org-evaluate-time-range (&amp;optional to-buffer)
  (interactive)
  (if (org-at-date-range-p t)
      (org-evaluate-time-range to-buffer)
    (let ((headline (buffer-substring (point-at-bol) (point-at-eol))))
      (with-temp-buffer
        (insert headline)
        (goto-char (point-at-bol))
        (re-search-forward org-ts-regexp (point-at-eol) t)
        (if (not (org-at-timestamp-p t))
            (error "No timestamp here"))
        (goto-char (match-beginning 0))
        (org-insert-time-stamp (current-time) nil nil)
        (insert "--")
        (org-evaluate-time-range to-buffer)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> Files and directories</h3>
<div class="outline-text-3" id="text-8-4">
<p>
We typically work out of the <code>~/org/</code> directory for the universal stuff.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-directory "~/org")
(setq brettw/org-journal-file "~/org/journal.org")
(setq org-agenda-files (list "~/org/" "~/"))
(setq org-default-notes-file (concat org-directory "/notes.org"))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> Global keyboard shortcuts</h3>
<div class="outline-text-3" id="text-8-5">
<p>
So <code>org-mode</code> can be accessed from anywhere!
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd "\C-c l") 'org-store-link)
(global-set-key (kbd "\C-c a") 'org-agenda)
(global-set-key (kbd "\C-c b") 'org-iswitchb)
(global-set-key (kbd "\C-c c") 'org-capture)
(global-set-key (kbd "C-M-j") 'brettw/jump-to-journal)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> Babel</h3>
<div class="outline-text-3" id="text-8-6">
</div><div id="outline-container-sec-8-6-1" class="outline-4">
<h4 id="sec-8-6-1"><span class="section-number-4">8.6.1</span> Languages</h4>
<div class="outline-text-4" id="text-8-6-1">
<p>
We'll usually only work on my favourite languages.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (C . t)
   (dot . t)
   (emacs-lisp . t)
   (latex . t)
   (python . t)
   )
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-6-2" class="outline-4">
<h4 id="sec-8-6-2"><span class="section-number-4">8.6.2</span> Settings</h4>
<div class="outline-text-4" id="text-8-6-2">
<p>
I'd prefer zero indentation.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-edit-src-content-indentation 0)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="section-number-3">8.7</span> Hyperlinks</h3>
<div class="outline-text-3" id="text-8-7">
</div><div id="outline-container-sec-8-7-1" class="outline-4">
<h4 id="sec-8-7-1"><span class="section-number-4">8.7.1</span> Settings</h4>
<div class="outline-text-4" id="text-8-7-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-return-follows-link t
      org-tab-follows-link t)

(setq org-link-frame-setup '((vm . vm-visit-folder-other-frame)
                             (vm-imap . vm-visit-imap-folder-other-frame)
                             (gnus . org-gnus-no-new-news)
                             (file . find-file)
                             (wl . wl-other-frame))
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-7-2" class="outline-4">
<h4 id="sec-8-7-2"><a id="ID-23a1353e-326a-49d3-93d3-8f2a127d5871" name="ID-23a1353e-326a-49d3-93d3-8f2a127d5871"></a><span class="section-number-4">8.7.2</span> Quicklinks</h4>
<div class="outline-text-4" id="text-8-7-2">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-link-abbrev-alist
      '(
        ("wikipedia" . "http://en.wikipedia.org/index.php?search=%h")
        ("contact" . "file:~/org/contacts.org::%s")
        )
)
</pre>
</div>
</div>
</div>
</div>
