bew_config.org
** Contacts

#+BEGIN_SRC emacs-lisp
;  (require 'org-contacts)
;  (add-to-list 'org-contacts-files (expand-file-name "~/org/contacts.org"))
#+END_SRC
** Agenda

*** Settings

#+BEGIN_SRC emacs-lisp
(setq org-agenda-skip-unavailable-files t
      org-include-diary t
      org-agenda-align-tags-to-column -100
      org-agenda-skip-additional-timestamps-same-entry nil
      org-agenda-skip-scheduled-if-done t
)
#+END_SRC
*** On load up

Show the agenda straight after Emacs initialization.

#+BEGIN_SRC emacs-lisp
(add-hook 'after-init-hook 'org-agenda-to-appt)
(add-hook 'after-init-hook 'org-agenda-list)
#+END_SRC
** To-do

*** Settings

#+BEGIN_SRC emacs-lisp
(setq org-enforce-todo-checkbox-dependencies t
      org-enforce-todo-dependencies t
      org-log-done t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords (list "TODO(t)" "STARTED(s)" "WAITING(w!)" "|" "DONE(d)" "CANCELLED(c@)"))
#+END_SRC
** =org2blog=

Make sure we autoload the required stuff.

#+BEGIN_SRC emacs-lisp
(require 'org2blog-autoloads)
#+END_SRC

*** Customization

We want to make sure before we post anything.
#+BEGIN_SRC emacs-lisp
(setq org2blog/wp-confirm-post t)
#+END_SRC

I don't like how it strips newlines.
#+BEGIN_SRC emacs-lisp
(setq org2blog/wp-keep-new-lines t)
#+END_SRC

Set the source code syntax.
#+BEGIN_SRC emacs-lisp
(setq org2blog/wp-use-sourcecode-shortcode t)
(setq org2blog/wp-sourcecode-default-params "")
#+END_SRC


** Capture

I capture bugs, todo and dev journal entries for my main project.

#+BEGIN_SRC emacs-lisp
(setq org-capture-templates
      '(
        ("t" "To-Do" entry (file "~/org/todo.org")
         "* TODO %?%i %^g\nDEADLINE: %^t\n%t \n\n" :empty-lines 1)
        ("T" "TDA To-Do" entry (file "e:/Projects/theDayAfter/doc/org/todo.org")
         "* TODO %i%? :tda:\n%t\n" :empty-lines 1)
        ("B" "TDA Bug" entry (file "e:/Projects/theDayAfter/doc/org/bugs.org")
         "* TODO %i%? :tda:bug:\n%t\n\n" :empty-lines 1)
        ("J" "TDA Dev Journal" entry (file+datetree "e:/Projects/thedayafter/doc/org/devjournal.org")
         "* %i%? :tda:\n%t\n" :empty-lines 1)
        ("m" "Meeting" entry (file+datetree+prompt "~/org/meetings.org")
         "* %?\n %^T\n" :empty-lines 1)
        ("s" "Spark" entry (file "~/org/spark.org")
         "* %? %^g\n%u %i\n\n")
        )
)
#+END_SRC
** Hooks

Global org hooks

#+BEGIN_SRC emacs-lisp
  (defun brettw/my-org-mode-hook ()
    (local-set-key (kbd "\M-n") 'outline-next-visible-heading)
    (local-set-key (kbd "\M-p") 'outline-previous-visible-heading)
    (visual-line-mode)
  )

(add-hook 'org-mode-hook 'brettw/my-org-mode-hook)
#+END_SRC

Specific org-list hooks:

#+BEGIN_SRC emacs-lisp
(eval-after-load 'org-list
  '(add-hook 'org-checkbox-statistics-hook (function brettw/checkbox-list-complete)))
#+END_SRC
* Programming

** General options

*** CEDET

Basic CEDET setup (based on the new 23.2+ merged CEDET/Emacs setup).

#+BEGIN_SRC emacs-lisp
(require 'cedet)
(require 'semantic/sb)
(semantic-mode 1)
#+END_SRC
*** Tabs and indents

Tab width is always, always, always 4, and indents are only spaces.

#+BEGIN_SRC emacs-lisp
(setq tab-width 4)
(set-default 'indent-tabs-mode nil)
#+END_SRC
*** Compilation

When a compile finishes correctly, we automatically close the compilation window.

#+BEGIN_SRC emacs-lisp
(defun compilation-exit-autoclose (status code msg)
  ;; If M-x compile exists with a 0
  (when (and (eq status 'exit) (zerop code))
    (bury-buffer)
    (delete-window (get-buffer-window (get-buffer "*compilation*"))))
  (cons msg code))

(setq compilation-exit-message-function 'compilation-exit-autoclose)

(setq compilation-scroll-output t)
#+END_SRC
*** Keys

#+BEGIN_SRC emacs-lisp
(add-hook 'c-mode-common-hook '( lambda ()
                                 (local-set-key (kbd "<S-f5>") 'compile)
                                 (local-set-key (kbd "<f5>") 'recompile)
                                 (local-set-key (kbd "RET") 'reindent-then-newline-and-indent)
                                 (local-set-key (kbd "C-M-o") 'ff-find-other-file)
                                 (local-set-key (kbd "<C-return>") 'complete-symbol)
))

(add-hook 'python-mode-hook '( lambda ()
                                 (local-set-key (kbd "<S-f5>") 'compile)
                                 (local-set-key (kbd "<f5>") 'recompile)
                                 (local-set-key (kbd "RET") 'reindent-then-newline-and-indent)
                                 (local-set-key (kbd "s-o") 'ff-find-other-file)
                                 (local-set-key (kbd "<C-return>") 'complete-symbol)
))
#+END_SRC
** Lisp
** HTML

#+BEGIN_SRC emacs-lisp
(require 'web-mode)
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.php?\\'" . web-mode))
(defun brettw/web-mode-hook () 
  (local-set-key (kbd "RET") 'newline-and-indent)
)

(add-hook 'web-mode-hook 'brettw/web-mode-hook)
#+END_SRC
** Python

*** Filenames

Use python mode for SCons files.

#+BEGIN_SRC emacs-lisp
(setq auto-mode-alist (cons '("SConstruct" . python-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("SConscript" . python-mode) auto-mode-alist))
#+END_SRC
*** Hook

When we "compile" in Python, we typically mean to invoke SCons (because we are usually editing SCons files!)

#+BEGIN_SRC emacs-lisp
(defun brettw/my-python-hook ()
  (setq compile-command "scons.py -D")
  (local-set-key (kbd "RET") 'newline-and-indent)
)

(add-hook 'python-mode-hook 'brettw/my-python-hook)
#+END_SRC
** C++

