bew_config.html

<div id="outline-container-sec-8-8" class="outline-3">
<h3 id="sec-8-8"><span class="section-number-3">8.8</span> Contacts</h3>
<div class="outline-text-3" id="text-8-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">;  (require 'org-contacts)
;  (add-to-list 'org-contacts-files (expand-file-name "~/org/contacts.org"))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-9" class="outline-3">
<h3 id="sec-8-9"><span class="section-number-3">8.9</span> Agenda</h3>
<div class="outline-text-3" id="text-8-9">
</div><div id="outline-container-sec-8-9-1" class="outline-4">
<h4 id="sec-8-9-1"><span class="section-number-4">8.9.1</span> Settings</h4>
<div class="outline-text-4" id="text-8-9-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-agenda-skip-unavailable-files t
      org-include-diary t
      org-agenda-align-tags-to-column -100
      org-agenda-skip-additional-timestamps-same-entry nil
      org-agenda-skip-scheduled-if-done t
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-9-2" class="outline-4">
<h4 id="sec-8-9-2"><span class="section-number-4">8.9.2</span> On load up</h4>
<div class="outline-text-4" id="text-8-9-2">
<p>
Show the agenda straight after Emacs initialization.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'org-agenda-to-appt)
(add-hook 'after-init-hook 'org-agenda-list)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8-10" class="outline-3">
<h3 id="sec-8-10"><span class="section-number-3">8.10</span> To-do</h3>
<div class="outline-text-3" id="text-8-10">
</div><div id="outline-container-sec-8-10-1" class="outline-4">
<h4 id="sec-8-10-1"><span class="section-number-4">8.10.1</span> Settings</h4>
<div class="outline-text-4" id="text-8-10-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-enforce-todo-checkbox-dependencies t
      org-enforce-todo-dependencies t
      org-log-done t)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-todo-keywords (list "TODO(t)" "STARTED(s)" "WAITING(w!)" "|" "DONE(d)" "CANCELLED(c@)"))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8-11" class="outline-3">
<h3 id="sec-8-11"><span class="section-number-3">8.11</span> <code>org2blog</code></h3>
<div class="outline-text-3" id="text-8-11">
<p>
Make sure we autoload the required stuff.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'org2blog-autoloads)
</pre>
</div>
</div>

<div id="outline-container-sec-8-11-1" class="outline-4">
<h4 id="sec-8-11-1"><span class="section-number-4">8.11.1</span> Customization</h4>
<div class="outline-text-4" id="text-8-11-1">
<p>
We want to make sure before we post anything.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org2blog/wp-confirm-post t)
</pre>
</div>

<p>
I don't like how it strips newlines.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org2blog/wp-keep-new-lines t)
</pre>
</div>

<p>
Set the source code syntax.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org2blog/wp-use-sourcecode-shortcode t)
(setq org2blog/wp-sourcecode-default-params "")
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8-12" class="outline-3">
<h3 id="sec-8-12"><span class="section-number-3">8.12</span> Capture</h3>
<div class="outline-text-3" id="text-8-12">
<p>
I capture bugs, todo and dev journal entries for my main project.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-capture-templates
      '(
        ("t" "To-Do" entry (file "~/org/todo.org")
         "* TODO %?%i %^g\nDEADLINE: %^t\n%t \n\n" :empty-lines 1)
        ("T" "TDA To-Do" entry (file "e:/Projects/theDayAfter/doc/org/todo.org")
         "* TODO %i%? :tda:\n%t\n" :empty-lines 1)
        ("B" "TDA Bug" entry (file "e:/Projects/theDayAfter/doc/org/bugs.org")
         "* TODO %i%? :tda:bug:\n%t\n\n" :empty-lines 1)
        ("J" "TDA Dev Journal" entry (file+datetree "e:/Projects/thedayafter/doc/org/devjournal.org")
         "* %i%? :tda:\n%t\n" :empty-lines 1)
        ("m" "Meeting" entry (file+datetree+prompt "~/org/meetings.org")
         "* %?\n %^T\n" :empty-lines 1)
        ("s" "Spark" entry (file "~/org/spark.org")
         "* %? %^g\n%u %i\n\n")
        )
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-13" class="outline-3">
<h3 id="sec-8-13"><span class="section-number-3">8.13</span> Hooks</h3>
<div class="outline-text-3" id="text-8-13">
<p>
Global org hooks
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">  (defun brettw/my-org-mode-hook ()
    (local-set-key (kbd "\M-n") 'outline-next-visible-heading)
    (local-set-key (kbd "\M-p") 'outline-previous-visible-heading)
    (visual-line-mode)
  )

(add-hook 'org-mode-hook 'brettw/my-org-mode-hook)
</pre>
</div>

<p>
Specific org-list hooks:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-load 'org-list
  '(add-hook 'org-checkbox-statistics-hook (function brettw/checkbox-list-complete)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Programming</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> General options</h3>
<div class="outline-text-3" id="text-9-1">
</div><div id="outline-container-sec-9-1-1" class="outline-4">
<h4 id="sec-9-1-1"><span class="section-number-4">9.1.1</span> CEDET</h4>
<div class="outline-text-4" id="text-9-1-1">
<p>
Basic CEDET setup (based on the new 23.2+ merged CEDET/Emacs setup).
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'cedet)
(require 'semantic/sb)
(semantic-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-1-2" class="outline-4">
<h4 id="sec-9-1-2"><span class="section-number-4">9.1.2</span> Tabs and indents</h4>
<div class="outline-text-4" id="text-9-1-2">
<p>
Tab width is always, always, always 4, and indents are only spaces.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq tab-width 4)
(set-default 'indent-tabs-mode nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-1-3" class="outline-4">
<h4 id="sec-9-1-3"><span class="section-number-4">9.1.3</span> Compilation</h4>
<div class="outline-text-4" id="text-9-1-3">
<p>
When a compile finishes correctly, we automatically close the compilation window.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun compilation-exit-autoclose (status code msg)
  ;; If M-x compile exists with a 0
  (when (and (eq status 'exit) (zerop code))
    (bury-buffer)
    (delete-window (get-buffer-window (get-buffer "*compilation*"))))
  (cons msg code))

(setq compilation-exit-message-function 'compilation-exit-autoclose)

(setq compilation-scroll-output t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-1-4" class="outline-4">
<h4 id="sec-9-1-4"><span class="section-number-4">9.1.4</span> Keys</h4>
<div class="outline-text-4" id="text-9-1-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'c-mode-common-hook '( lambda ()
                                 (local-set-key (kbd "&lt;S-f5&gt;") 'compile)
                                 (local-set-key (kbd "&lt;f5&gt;") 'recompile)
                                 (local-set-key (kbd "RET") 'reindent-then-newline-and-indent)
                                 (local-set-key (kbd "C-M-o") 'ff-find-other-file)
                                 (local-set-key (kbd "&lt;C-return&gt;") 'complete-symbol)
))

(add-hook 'python-mode-hook '( lambda ()
                                 (local-set-key (kbd "&lt;S-f5&gt;") 'compile)
                                 (local-set-key (kbd "&lt;f5&gt;") 'recompile)
                                 (local-set-key (kbd "RET") 'reindent-then-newline-and-indent)
                                 (local-set-key (kbd "s-o") 'ff-find-other-file)
                                 (local-set-key (kbd "&lt;C-return&gt;") 'complete-symbol)
))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Lisp</h3>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> HTML</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'web-mode)
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.php?\\'" . web-mode))
(defun brettw/web-mode-hook () 
  (local-set-key (kbd "RET") 'newline-and-indent)
)

(add-hook 'web-mode-hook 'brettw/web-mode-hook)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> Python</h3>
<div class="outline-text-3" id="text-9-4">
</div><div id="outline-container-sec-9-4-1" class="outline-4">
<h4 id="sec-9-4-1"><span class="section-number-4">9.4.1</span> Filenames</h4>
<div class="outline-text-4" id="text-9-4-1">
<p>
Use python mode for SCons files.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq auto-mode-alist (cons '("SConstruct" . python-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("SConscript" . python-mode) auto-mode-alist))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-4-2" class="outline-4">
<h4 id="sec-9-4-2"><span class="section-number-4">9.4.2</span> Hook</h4>
<div class="outline-text-4" id="text-9-4-2">
<p>
When we "compile" in Python, we typically mean to invoke SCons (because we are usually editing SCons files!)
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun brettw/my-python-hook ()
  (setq compile-command "scons.py -D")
  (local-set-key (kbd "RET") 'newline-and-indent)
)

(add-hook 'python-mode-hook 'brettw/my-python-hook)
</pre>
</div>
</div>
</div>
</div>
