bew_config.org
*** Filenames

CUDA is C++, so make Emacs aware of it.

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.cu\\'" . c++-mode))
(add-to-list 'auto-mode-alist '("\\.cuh\\'" . c++-mode))
#+END_SRC
*** Style

This is my C/C++ style.

#+BEGIN_SRC emacs-lisp
(setq c-basic-offset 4
      c-doc-comment-style (quote javadoc))

(defconst brettw/my-c-style
  '((c-tab-always-indent         . t)
    (c-hanging-braces-alist      . ((substatement-open after)
                                    (brace-list-open)))
    (c-hanging-colons-alist      . ((member-init-intro before)
                                    (inher-intro)
                                    (case-label after)
                                    (label after)
                                    (access-label after)))
    (c-cleanu-list               . (scope-operator
                                    empty-defun-braces
                                    defun-close-semi))
    (c-offsets-alist             . ((arglist-close . c-lineup-arglist)
                                    (substatement-open . 0)
                                    (case-label        . +)
                                    (block-open        . 0)
                                    (access-label      . -)
                                    (knr-argdecl-intro . -)))
    )
  "BEW C Programming Style")

(c-add-style "brettw" brettw/my-c-style)
#+END_SRC
*** Hooks

Set a bunch of my defaults.

#+BEGIN_SRC emacs-lisp
(defun brettw/my-c-mode-common-hook ()
  (global-set-key (kbd "<M-return>") 'semantic-ia-complete-symbol)
  (c-set-style "brettw")
  (setq compile-command "scons.py -D")
  )

(add-hook 'c-mode-common-hook 'brettw/my-c-mode-common-hook)
(add-hook 'c++-mode-hook 'brettw/my-c-mode-common-hook)
#+END_SRC
** Projects

I put project-specific settings here (especially =semantic-add-system-include= settings)

* Utilities

** Twitter

=twittering-mode= is pretty awesome. That'll keep.

#+BEGIN_SRC emacs-lisp
(setq twittering-use-master-password t)
(setq twittering-icon-mode t)
(setq twittering-timer-interval 300)
#+END_SRC

** Webjump

Webjump is neat and gives us very quick access to search.

#+BEGIN_SRC emacs-lisp
(require 'webjump)

(global-set-key '[f2] 'webjump)
(setq webjump-sites '(
                      ("Urban Dictionary" .
                       [simple-query "www.urbandictionary.com"
                                     "http://www.urbandictionary.com/define.php?term=" ""])
                      ("Reddit Search" .
                       [simple-query "www.reddit.com"
                                     "http://www.reddit.com/search?q=" ""])
                      ("Google Image Search" .
                       [simple-query "images.google.com" "images.google.com/images?hl=en&q=" ""])
                      ("Google" .
                       [simple-query "google.com" "www.google.com.au/search?q=" ""])
                      ("StackOverflow" .
                       [simple-query "stackoverflow.com" "stackoverflow.com/search?q=" ""])

                      )

)
#+END_SRC
