bew_config.html

<div id="outline-container-sec-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> C++</h3>
<div class="outline-text-3" id="text-9-5">
</div><div id="outline-container-sec-9-5-1" class="outline-4">
<h4 id="sec-9-5-1"><span class="section-number-4">9.5.1</span> Filenames</h4>
<div class="outline-text-4" id="text-9-5-1">
<p>
CUDA is C++, so make Emacs aware of it.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '("\\.cu\\'" . c++-mode))
(add-to-list 'auto-mode-alist '("\\.cuh\\'" . c++-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-5-2" class="outline-4">
<h4 id="sec-9-5-2"><span class="section-number-4">9.5.2</span> Style</h4>
<div class="outline-text-4" id="text-9-5-2">
<p>
This is my C/C++ style.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq c-basic-offset 4
      c-doc-comment-style (quote javadoc))

(defconst brettw/my-c-style
  '((c-tab-always-indent         . t)
    (c-hanging-braces-alist      . ((substatement-open after)
                                    (brace-list-open)))
    (c-hanging-colons-alist      . ((member-init-intro before)
                                    (inher-intro)
                                    (case-label after)
                                    (label after)
                                    (access-label after)))
    (c-cleanu-list               . (scope-operator
                                    empty-defun-braces
                                    defun-close-semi))
    (c-offsets-alist             . ((arglist-close . c-lineup-arglist)
                                    (substatement-open . 0)
                                    (case-label        . +)
                                    (block-open        . 0)
                                    (access-label      . -)
                                    (knr-argdecl-intro . -)))
    )
  "BEW C Programming Style")

(c-add-style "brettw" brettw/my-c-style)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-5-3" class="outline-4">
<h4 id="sec-9-5-3"><span class="section-number-4">9.5.3</span> Hooks</h4>
<div class="outline-text-4" id="text-9-5-3">
<p>
Set a bunch of my defaults.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun brettw/my-c-mode-common-hook ()
  (global-set-key (kbd "&lt;M-return&gt;") 'semantic-ia-complete-symbol)
  (c-set-style "brettw")
  (setq compile-command "scons.py -D")
  )

(add-hook 'c-mode-common-hook 'brettw/my-c-mode-common-hook)
(add-hook 'c++-mode-hook 'brettw/my-c-mode-common-hook)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> Projects</h3>
<div class="outline-text-3" id="text-9-6">
<p>
I put project-specific settings here (especially <code>semantic-add-system-include</code> settings)
</p>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Utilities</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Twitter</h3>
<div class="outline-text-3" id="text-10-1">
<p>
<code>twittering-mode</code> is pretty awesome. That'll keep.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq twittering-use-master-password t)
(setq twittering-icon-mode t)
(setq twittering-timer-interval 300)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Webjump</h3>
<div class="outline-text-3" id="text-10-2">
<p>
Webjump is neat and gives us very quick access to search.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'webjump)

(global-set-key '[f2] 'webjump)
(setq webjump-sites '(
                      ("Urban Dictionary" .
                       [simple-query "www.urbandictionary.com"
                                     "http://www.urbandictionary.com/define.php?term=" ""])
                      ("Reddit Search" .
                       [simple-query "www.reddit.com"
                                     "http://www.reddit.com/search?q=" ""])
                      ("Google Image Search" .
                       [simple-query "images.google.com" "images.google.com/images?hl=en&amp;q=" ""])
                      ("Google" .
                       [simple-query "google.com" "www.google.com.au/search?q=" ""])
                      ("StackOverflow" .
                       [simple-query "stackoverflow.com" "stackoverflow.com/search?q=" ""])

                      )

)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Witty</p>
<p class="date">Created: 2014-03-04 Tue 22:19</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
